ral_colors = [
    'RAL 1000 Зелёно-бежевый',
    'RAL 1001 Бежевый',
    'RAL 1002 Песочно-жёлтый',
    'RAL 1003 Сигнальный жёлтый',
    'RAL 1004 Жёлто-золотой',
    'RAL 1005 Медово-жёлтый',
    'RAL 1006 Кукурузно-жёлтый',
    'RAL 1007 Нарциссово-жёлтый',
    'RAL 1011 Коричнево-бежевый',
    'RAL 1012 Лимонно-жёлтый',
    'RAL 1013 Жемчужно-белый',
    'RAL 1014 Слоновая кость',
    'RAL 1015 Светлая слоновая кость',
    'RAL 1016 Жёлтая сера',
    'RAL 1017 Шафраново-жёлтый',
    'RAL 1018 Цинково-жёлтый',
    'RAL 1019 Серо-бежевый',
    'RAL 1020 Оливково-жёлтый',
    'RAL 1021 Рапсово-жёлтый',
    'RAL 1023 Транспортно-жёлтый',
    'RAL 1024 Охра жёлтая',
    'RAL 1026 Люминесцентный жёлтый',
    'RAL 1027 Карри жёлтый',
    'RAL 1028 Дынно-жёлтый',
    'RAL 1032 Жёлтый ракитник',
    'RAL 1033 Георгиново-жёлтый',
    'RAL 1034 Пастельно-жёлтый',
    'RAL 1035 Перламутрово-бежевый',
    'RAL 1036 Перламутрово-золотой',
    'RAL 1037 Солнечно-жёлтый',
    'RAL 2000 Жёлто-оранжевый',
    'RAL 2001 Красно-оранжевый',
    'RAL 2002 Алый',
    'RAL 2003 Пастельно-оранжевый',
    'RAL 2004 Оранжевый',
    'RAL 2005 Люминесцентный оранжевый',
    'RAL 2007 Люминесцентный ярко-оранжевый',
    'RAL 2008 Ярко-красно-оранжевый',
    'RAL 2009 Транспортный оранжевый',
    'RAL 2010 Сигнальный оранжевый',
    'RAL 2011 Насыщенный оранжевый',
    'RAL 2012 Лососёво-оранжевый',
    'RAL 2013 Перламутрово-оранжевый',
    'RAL 3000 Огненно-красный',
    'RAL 3001 Сигнальный красный',
    'RAL 3002 Карминно-красный',
    'RAL 3003 Рубиново-красный',
    'RAL 3004 Пурпурно-красный',
    'RAL 3005 Винно-красный',
    'RAL 3007 Чёрно-красный',
    'RAL 3009 Оксид красный',
    'RAL 3011 Коричнево-красный',
    'RAL 3012 Бежево-красный',
    'RAL 3013 Томатно-красный',
    'RAL 3014 Розовый антик',
    'RAL 3015 Светло-розовый',
    'RAL 3016 Кораллово-красный',
    'RAL 3017 Розовый',
    'RAL 3018 Клубнично-красный',
    'RAL 3020 Транспортный красный',
    'RAL 3022 Лососёво-красный',
    'RAL 3024 Люминесцентный красный',
    'RAL 3026 Люминесцентный ярко-красный',
    'RAL 3027 Малиново-красный',
    'RAL 3028 Красный',
    'RAL 3031 Ориент красный',
    'RAL 3032 Перламутрово-рубиновый',
    'RAL 3033 Перламутрово-розовый',
    'RAL 4001 Красно-сиреневый',
    'RAL 4002 Красно-фиолетовый',
    'RAL 4003 Вересково-фиолетовый',
    'RAL 4004 Бордово-фиолетовый',
    'RAL 4005 Сине-сиреневый',
    'RAL 4006 Транспортный пурпурный',
    'RAL 4007 Пурпурно-фиолетовый',
    'RAL 4008 Сигнальный фиолетовый',
    'RAL 4009 Пастельно-фиолетовый',
    'RAL 4010 Телемагента',
    'RAL 4011 Перламутрово-фиолетовый',
    'RAL 4012 Перламутрово-ежевичный',
    'RAL 5000 Фиолетово-синий',
    'RAL 5001 Зелёно-синий',
    'RAL 5002 Ультрамариново-синий',
    'RAL 5003 Сапфирово-синий',
    'RAL 5004 Чёрно-синий',
    'RAL 5005 Сигнальный синий',
    'RAL 5007 Бриллиантово-синий',
    'RAL 5008 Серо-синий',
    'RAL 5009 Лазурно-синий',
    'RAL 5010 Горечавково-синий',
    'RAL 5011 Стально-синий',
    'RAL 5012 Голубой',
    'RAL 5013 Кобальтово-синий',
    'RAL 5014 Голубино-синий',
    'RAL 5015 Небесно-синий',
    'RAL 5017 Транспортный синий',
    'RAL 5018 Бирюзово-синий',
    'RAL 5019 Капри синий',
    'RAL 5020 Океанская синь',
    'RAL 5021 Водная синь',
    'RAL 5022 Ночной синий',
    'RAL 5023 Отдалённо-синий',
    'RAL 5024 Пастельно-синий',
    'RAL 5025 Перламутровый горечавково-синий',
    'RAL 5026 Перламутровый ночной синий',
    'RAL 6000 Патиново-зелёный',
    'RAL 6001 Изумрудно-зелёный',
    'RAL 6002 Лиственно-зелёный',
    'RAL 6003 Оливково-зелёный',
    'RAL 6004 Сине-зелёный',
    'RAL 6005 Зелёный мох',
    'RAL 6006 Серо-оливковый',
    'RAL 6007 Бутылочно-зелёный',
    'RAL 6008 Коричнево-зелёный',
    'RAL 6009 Пихтовый зелёный',
    'RAL 6010 Травяной зелёный',
    'RAL 6011 Резедово-зелёный',
    'RAL 6012 Чёрно-зелёный',
    'RAL 6013 Тростниково-зелёный',
    'RAL 6014 Жёлто-оливковый',
    'RAL 6015 Чёрно-оливковый',
    'RAL 6016 Бирюзово-зелёный',
    'RAL 6017 Майский зелёный',
    'RAL 6018 Желто-зелёный',
    'RAL 6019 Бело-зелёный',
    'RAL 6020 Хромовый зелёный',
    'RAL 6021 Бледно-зелёный',
    'RAL 6022 Коричнево-оливковый',
    'RAL 6024 Транспортный зелёный',
    'RAL 6025 Папоротниково-зелёный',
    'RAL 6026 Опаловый зелёный',
    'RAL 6027 Светло-зелёный',
    'RAL 6028 Сосновый зелёный',
    'RAL 6029 Мятно-зелёный',
    'RAL 6032 Сигнальный зелёный',
    'RAL 6033 Мятно-бирюзовый',
    'RAL 6034 Пастельно-бирюзовый',
    'RAL 6035 Перламутрово-зелёный',
    'RAL 6036 Перламутровый опаловый зелёный',
    'RAL 6037 Зелёный',
    'RAL 6038 Люминесцентный зелёный',
    'RAL 7000 Серая белка',
    'RAL 7001 Серебристо-серый',
    'RAL 7002 Оливково-серый',
    'RAL 7003 Серый мох',
    'RAL 7004 Сигнальный серый',
    'RAL 7005 Мышино-серый',
    'RAL 7006 Бежево-серый',
    'RAL 7008 Серое хаки',
    'RAL 7009 Зелёно-серый',
    'RAL 7010 Брезентово-серый',
    'RAL 7011 Железно-серый',
    'RAL 7012 Базальтово-серый',
    'RAL 7013 Коричнево-серый',
    'RAL 7015 Сланцево-серый',
    'RAL 7016 Антрацитово-серый',
    'RAL 7021 Чёрно-серый',
    'RAL 7022 Серая умбра',
    'RAL 7023 Серый бетон',
    'RAL 7024 Графитовый серый',
    'RAL 7026 Гранитовый серый',
    'RAL 7030 Каменно-серый',
    'RAL 7031 Сине-серый',
    'RAL 7032 Галечный серый',
    'RAL 7033 Цементно-серый',
    'RAL 7034 Жёлто-серый',
    'RAL 7035 Светло-серый',
    'RAL 7036 Платиново-серый',
    'RAL 7037 Пыльно-серый',
    'RAL 7038 Агатовый серый',
    'RAL 7039 Кварцевый серый',
    'RAL 7040 Серое окно',
    'RAL 7042 Транспортный серый A',
    'RAL 7043 Транспортный серый B',
    'RAL 7044 Серый шёлк',
    'RAL 7045 Телегрей 1',
    'RAL 7046 Телегрей 2',
    'RAL 7047 Телегрей 4',
    'RAL 7048 Перламутровый мышино-серый',
    'RAL 8000 Зелёно-коричневый',
    'RAL 8001 Охра коричневая',
    'RAL 8002 Сигнальный коричневый',
    'RAL 8003 Глиняный коричневый',
    'RAL 8004 Медно-коричневый',
    'RAL 8007 Олень коричневый',
    'RAL 8008 Оливково-коричневый',
    'RAL 8011 Орехово-коричневый',
    'RAL 8012 Красно-коричневый',
    'RAL 8014 Сепия коричневый',
    'RAL 8015 Каштаново-коричневый',
    'RAL 8016 Махагон коричневый',
    'RAL 8017 Шоколадно-коричневый',
    'RAL 8019 Серо-коричневый',
    'RAL 8022 Чёрно-коричневый',
    'RAL 8023 Оранжево-коричневый',
    'RAL 8024 Бежево-коричневый',
    'RAL 8025 Бледно-коричневый',
    'RAL 8028 Терракотовый',
    'RAL 8029 Перламутровый медный',
    'RAL 9001 Кремово-белый',
    'RAL 9002 Светло-серый',
    'RAL 9003 Сигнальный белый',
    'RAL 9004 Сигнальный чёрный',
    'RAL 9005 Чёрный янтарь',
    'RAL 9006 Бело-алюминиевый',
    'RAL 9007 Тёмно-алюминиевый',
    'RAL 9010 Белый',
    'RAL 9011 Графитно-чёрный',
    'RAL 9016 Транспортный белый',
    'RAL 9017 Транспортный чёрный',
    'RAL 9018 Папирусно-белый',
    'RAL 9022 Перламутровый светло-серый',
    'RAL 9023 Перламутровый тёмно-серый',
]

matrix = (
    (  # qty - 0
        (  # ireg- 0
            (  # i - 0, 0-0-0
                ('PO End LR.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,
                 ),
            ),
            (  # i - 1, 0-0-1
                ('PO End L Gap.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
            (  # i - 2, 0-0-2
                ('PO Irreg PD.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
            (  # i - 3, 0-0-3
                ('PO End R Gap.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
        ),
        (  # ireg- 1
            (  # i - 0, 0-1-0
                ('Not used',),
            ),
            (  # i - 1, 0-1-1
                ('Not used',),
            ),
            (  # i - 2, 0-1-2
                ('PO Irreg P.SLDASM', 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
            (  # i - 3, 0-1-3
                ('Not used',),
            ),
        ),
    ),
    (  # qty - 1
        (  # ireg- 0
            (  # i - 0, 1-0-0
                ('PO End L.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO Reg.SLDASM', 0, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO End R.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
            (  # i - 1, 1-0-1
                ('PO End L.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO Reg.SLDASM', 0, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO Irreg R.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
            (  # i - 2, 1-0-2
                ('PO Irreg L.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO Reg.SLDASM', 0, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO Irreg R.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
            (  # i - 3, 1-0-2
                ('PO Irreg L.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO Reg.SLDASM', 0, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
                ('PO End R.SLDASM', 1, 1500, 0, 0, 0, 0, 0, 0, 0, 0,),
            ),
        ),
    ),
)

gap_sections = (
    'PO Irreg P.SLDASM',
    'PO End L Gap.SLDASM',
    'PO Irreg R.SLDASM',
)

end_sections = (
    'PO End R.SLDASM',
    'PO End LR.SLDASM',
    'PO End R Gap.SLDASM',
)

beam_dist = (
    '703',
    '728',
)

common_parts = (
    'Pillar Cookie.sldprt',
    'Pillar Fitting.sldprt',
    'Railing Fitting.sldprt',
    'Tube.sldprt',
    'Beam Connector.sldprt',
    'End Beam Connector.sldprt',
    'Railing Gap Connector.sldprt',
    'End Cover Bottom.sldprt',
    'End Cover Mid.sldprt',
    'End Cover Top.sldprt',
    'End Cover Pillar.sldprt',
    'End Railing Vert.sldprt',
    'Irreg L P Connector.sldprt',
)

sw_variables_assembly = {
    'l': 2,
    'doubleSection': 9,
    'offsetL': 3,
    'offsetR': 4,
    'gap': 7,
    'offsetEndL': 5,
    'offsetEndR': 6,
    'offsetNext': 8,
}

sw_variables_part = (
    'lPart',
    'beamToBeamDistPart',
    'newFittingPart',
    'offsetLPart',
    'offsetRPart',
    'gapPart',
    'doubleSectionPart',
    'endRailOffsetRPart',
    'endRailOffsetLPart',
    'offsetNextPart',
)

to_dxf_ends = {
    # законцовки
    'End L Railing Bottom': '88x58 нижняя левая НУЖНА КОРРЕКЦИЯ',
    'End R Railing Bottom': '88x58 нижняя правая НУЖНА КОРРЕКЦИЯ',
    'End LR Railing Bottom L': '88x58 нижняя левая НУЖНА КОРРЕКЦИЯ',
    'End LR Railing Bottom R': '88x58 нижняя правая НУЖНА КОРРЕКЦИЯ',
    'End L Gap Railing Bottom': '88x58 нижняя левая НУЖНА КОРРЕКЦИЯ',
    'End R Gap Railing Bottom': '88x58 нижняя правая НУЖНА КОРРЕКЦИЯ',

    'End L Railing Angle': '88x58 левая НУЖНА КОРРЕКЦИЯ',
    'End R Railing Angle': '88x58 правая НУЖНА КОРРЕКЦИЯ',
    'End LR Railing Angle L': '88x58 левая НУЖНА КОРРЕКЦИЯ',
    'End LR Railing Angle R': '88x58 правая НУЖНА КОРРЕКЦИЯ',
    'End L Gap Railing Angle': '88x58 левая НУЖНА КОРРЕКЦИЯ',
    'End R Gap Railing Angle': '88x58 правая НУЖНА КОРРЕКЦИЯ',

    'End Beam Top': '40x40 верхняя',
    'End R Beam Top': '40x40 верхняя',
    'End LR Beam Top': '40x40 верхняя',
    'End L Gap Beam Top': '40x40 верхняя',
    'End R Gap Beam Top': '40x40 верхняя',

    'End LR Pillar R': '88x58 правая',
    'End L Pillar': '88x58 левая',
    # 'End R Pillar': '88x58 правая',
    'End R Pillar R': '88x58 правая',
    'End L Gap Pillar L': '88x58 левая',
    'End R Gap Pillar R': '88x58 правая',
}

to_dxf_parts = {
    # основные
    # 'End L Gap Pillar': '88x58',
    # 'End R Gap Pillar': '88x58',
    'End LR Pillar L': '88x58 левая',
    # 'Irreg L Pillar': '88x58',
    # 'Irreg P Pillar': '88x58',
    # 'Irreg R Pillar': '88x58',
    'Reg Pillar': '88x58 опора',

    'End L Railing': '88x58 НУЖНА КОРРЕКЦИЯ',
    'End R Railing': '88x58 НУЖНА КОРРЕКЦИЯ',
    'End LR Railing': '88x58 НУЖНА КОРРЕКЦИЯ',
    'End L Gap Railing': '88x58 НУЖНА КОРРЕКЦИЯ',
    'End R Gap Railing': '88x58 НУЖНА КОРРЕКЦИЯ',
    'Irreg L Railing': '88x58',
    'Irreg P Railing': '88x58',
    'Irreg R Railing': '88x58',
    'Reg Railing': '88x58',

    'End L Beam': '40x40',
    'End R Beam': '40x40',
    'End LR Beam': '40x40',
    'Irreg L Beam': '40x40',
    'Irreg P Beam': '40x40',
    'Irreg R Beam': '40x40',
    'Reg Beam': '40x40',

    'End L Gap Beam': '40x40 дефшов',
    'End R Gap Beam': '40x40 дефшов',
    'End L Gap Beam Gap': '40x40 дефшов',
    'Irreg P Beam Gap': '40x40 дефшов',
    'Irreg R Beam Gap': '40x40 дефшов',
}

drv_dim = (5.0, 4.5)  # drawing dimensions in meters

views = (
    ("*Right", drv_dim[0] / 2, 2.55),
    ("*Front", drv_dim[0] / 2, 2.35),
    ("*Left", drv_dim[0] / 2, 2.15),
    ("*Back", drv_dim[0] / 2, 1.95),
    # ("*Top", 2, 0.5),
    # ("*Bottom", 2, 4),
)

# views = (
#     ("*Справа", drv_dim[0] / 2, 2.55),
#     ("*Спереди", drv_dim[0] / 2, 2.35),
#     ("*Слева", drv_dim[0] / 2, 2.15),
#     ("*Сзади", drv_dim[0] / 2, 1.95),
#     # ("*Сверху", 2, 0.5),
#     # ("*Снизу", 2, 4),
# )

# Название параметров в текстовом файле в порядке чтения
saved_parameters = [
    ['prj_name', 'prjName'],  # 0
    ['prj_manager', 'prjManager'],  # 1
    ['gap_qty', 'gapQty'],  # 2
    ['blength', 'bridgeLength'],  # 3
    ['beem_dist', 'beam'],  # 4
    ['overhang_end_l', 'overhangEndL'],  # 5
    ['overhang_end_r', 'overhangEndR'],  # 6
    ['pillar_dist_list', 'pillarDistList', 'pillarDist', 'pillar_dist'],  # 7
    ['use_double_sections', 'useDoubleSections'],  # 8
    ['new_fitting', 'newFittings'],  # 9
    ['gap_wdth', 'gapWdths'],  # 10
    ['lenth_list', 'lengths'],  # 11
    ['before_gaps_l', 'beforeGapsL', 'beforeGapL', 'before_gap_l'],  # 12
    ['before_gaps_r', 'beforeGapsR', 'beforeGapR', 'before_gap_r'],  # 13
    'bridge_config',  # 14
]

manual = """\n
# Ручное конфигурирование перил:
# Указывайте расстояния между стойками перил слева направо через пробел.
# Двойные секции расчитывать не нужно, они будут рассчитаны автоматически.
#
# Шаблоны, которые можно использовать при описании расстояний между стойками:
# 1) Одинаковые повторяющиеся длины L можно указывать как NxL, где N - целое число, например 3x1450.
# 2) Одинаковые повторяющиеся наборы длин L1, L2 ... Ln можно указывать как Nx(L1, L2, ..., Ln), где N - целое число.
# Внутри скобок можно использовать запись в виде шаблона 1. 
#
# Примеры:
# 3x1450
# 900 5х1500 1200 800
# 1300 3x(1350 1100) 900
# 1500 2x900 10x(1500 4x1300 1500) 1400
#
# _ - в месте нахождения деформационного шва пишите нижнее подчеркивание.
#
# Для вставки краевых секций посреди моста, например возле столбов, используйте перенос строки.
# Начало строки - левая крайняя секция.
# Конец строки - правая крайняя секция.
#
# Допускается оставлять дополнительные пустые строки для удобства восприятия.
#
# Строка, следующая после строки с расстояниями между стойками, должна содержать 3 числа для описания разрыва перил:
# - Первое число - расстояние между стойками соседних краевых секций пролетов перил.
# - Второе и третье числа - длины свесов секций слева и справа от разрыва соответственно (см. пример).
# Следующий пролет перил должен начаться с новой строки.
#
# Для прерывания пролета перил (калитка, проход и т.п.) без использования краевых секций используйте 
# символ ! с указанием длины прерывания по осям стоек, например !650.
#
# Пример:
# В примере мост с 2-мя дефшвами. 
# Между дефшвами на мосту установлены 2 фонарных столба. 
# Перила прерываются возле столбов краевыми секциями и расстоянием между стойками соседних краевых секций 700 мм.
#
# 800 1200 1420 1340 900 5х1500 _ 1200 800 3х1300
# 700 252 260
# 1200 5х1200 1500
# 700 252 260
# 1480 900 _ 7х1300 800\n
"""
